## CI Results

| Check | Status |
|-------|--------|
| Terraform Validate | ✅ success |
| Terraform Plan | ✅ ⚠️ Changes detected — review before merge. |
| Ansible Lint | ✅ success |
| Security Scan | ✅ success |

<details><summary>Full plan output</summary>

```hcl
[0m
[0m[1mmodule.alb_asg.aws_lb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:615299732970:listener/app/prod-alb/07f73b74694b925e/565e07c8e65602ae][0m
[0m[1mmodule.alb_asg.aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:615299732970:listener/app/prod-alb/07f73b74694b925e/902f360b2057ae96][0m
[0m[1mmodule.ghost_db.aws_cloudwatch_metric_alarm.database_connections: Refreshing state... [id=prod-ghost-db-connections][0m
[0m[1mmodule.ghost_db.aws_cloudwatch_metric_alarm.database_cpu: Refreshing state... [id=prod-ghost-db-cpu-utilization][0m
[0m[1mmodule.ghost_db.aws_ssm_parameter.db_port: Refreshing state... [id=/prod/ghost/db/port][0m
[0m[1mmodule.ghost_db.aws_cloudwatch_metric_alarm.database_memory: Refreshing state... [id=prod-ghost-db-freeable-memory][0m
[0m[1mmodule.ghost_db.aws_ssm_parameter.db_host: Refreshing state... [id=/prod/ghost/db/host][0m
[0m[1mmodule.ghost_db.aws_cloudwatch_metric_alarm.database_storage: Refreshing state... [id=prod-ghost-db-free-storage][0m
[0m[1mmodule.ghost_blog.aws_iam_role.ecs_task_execution: Refreshing state... [id=prod-ghost-task-execution-role][0m
[0m[1mmodule.ghost_blog.data.aws_region.current: Reading...[0m[0m
[0m[1mmodule.ghost_blog.aws_iam_policy.ghost_task: Refreshing state... [id=arn:aws:iam::615299732970:policy/prod-ghost-task-policy][0m
[0m[1mmodule.ghost_blog.aws_ecs_cluster.ghost: Refreshing state... [id=arn:aws:ecs:us-east-1:615299732970:cluster/prod-ghost-cluster][0m
[0m[1mmodule.ghost_blog.data.aws_region.current: Read complete after 0s [id=us-east-1][0m
[0m[1mmodule.ghost_blog.aws_cloudwatch_log_group.ghost: Refreshing state... [id=/ecs/prod/ghost][0m
[0m[1mmodule.ghost_blog.aws_iam_role.ecs_task: Refreshing state... [id=prod-ghost-task-role][0m
[0m[1mmodule.ghost_blog.aws_security_group.ghost_alb: Refreshing state... [id=sg-095e4d6ccfe49c96f][0m
[0m[1mmodule.ghost_blog.aws_lb_target_group.ghost: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:615299732970:targetgroup/prod-ghost-tg/914120788a48957a][0m
[0m[1mmodule.ghost_blog.aws_efs_file_system.ghost: Refreshing state... [id=fs-0d346bc6cb073015c][0m
[0m[1mmodule.ghost_blog.aws_iam_role_policy_attachment.ghost_task: Refreshing state... [id=prod-ghost-task-role/arn:aws:iam::615299732970:policy/prod-ghost-task-policy][0m
[0m[1mmodule.ghost_blog.aws_security_group.ghost_tasks: Refreshing state... [id=sg-06acb62dd14056eff][0m
[0m[1mmodule.ghost_blog.aws_lb.ghost: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:615299732970:loadbalancer/app/prod-ghost-alb/13a9149355380131][0m
[0m[1mmodule.ghost_blog.aws_iam_role_policy.ecs_task_execution_secrets: Refreshing state... [id=prod-ghost-task-execution-role:prod-ghost-execution-secrets][0m
[0m[1mmodule.ghost_blog.aws_iam_role_policy_attachment.ecs_task_execution: Refreshing state... [id=prod-ghost-task-execution-role/arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy][0m
[0m[1mmodule.ghost_blog.aws_efs_access_point.ghost: Refreshing state... [id=fsap-09f52e97191173d1d][0m
[0m[1mmodule.ghost_blog.aws_security_group.ghost_efs: Refreshing state... [id=sg-08d9221d1fdc541ac][0m
[0m[1mmodule.ghost_blog.aws_ecs_task_definition.ghost: Refreshing state... [id=prod-ghost][0m
[0m[1mmodule.ghost_blog.aws_efs_mount_target.ghost[1]: Refreshing state... [id=fsmt-059bb42387fe51aea][0m
[0m[1mmodule.ghost_blog.aws_efs_mount_target.ghost[0]: Refreshing state... [id=fsmt-036b69a515fe3b835][0m
[0m[1mmodule.ghost_blog.aws_route53_record.ghost: Refreshing state... [id=Z04492601HFUDC7HTYJ6B_claudiq.com_A][0m
[0m[1mmodule.ghost_blog.aws_route53_record.ghost_www: Refreshing state... [id=Z04492601HFUDC7HTYJ6B_www.claudiq.com_A][0m
[0m[1mmodule.ghost_blog.aws_lb_listener.ghost_https: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:615299732970:listener/app/prod-ghost-alb/13a9149355380131/6e8212ff0af738ae][0m
[0m[1mmodule.ghost_blog.aws_lb_listener.ghost_http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:615299732970:listener/app/prod-ghost-alb/13a9149355380131/f0f7f817419a9c92][0m
[0m[1mmodule.ghost_blog.aws_ecs_service.ghost: Refreshing state... [id=arn:aws:ecs:us-east-1:615299732970:service/prod-ghost-cluster/prod-ghost-service][0m
[0m[1mmodule.monitoring.data.aws_region.current: Reading...[0m[0m
[0m[1mmodule.observability[0].aws_service_discovery_private_dns_namespace.monitoring: Refreshing state... [id=ns-36zgsqjndk6e5zki][0m
[0m[1mmodule.monitoring.aws_cloudwatch_metric_alarm.alb_unhealthy_targets: Refreshing state... [id=prod-alb-unhealthy-targets][0m
[0m[1mmodule.observability[0].aws_lb_target_group.grafana: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:615299732970:targetgroup/prod-grafana-tg/0a5972b54cce8b5b][0m
[0m[1mmodule.monitoring.data.aws_region.current: Read complete after 0s [id=us-east-1][0m
[0m[1mmodule.observability[0].aws_iam_role.prometheus_task: Refreshing state... [id=prod-prometheus-task-role][0m
[0m[1mmodule.observability[0].aws_cloudwatch_log_group.prometheus: Refreshing state... [id=/ecs/prod/prometheus][0m
[0m[1mmodule.monitoring.aws_cloudwatch_metric_alarm.asg_cpu_high: Refreshing state... [id=prod-asg-cpu-high][0m
[0m[1mmodule.monitoring.aws_cloudwatch_metric_alarm.ghost_memory_high[0]: Refreshing state... [id=prod-ghost-memory-high][0m
[0m[1mmodule.observability[0].aws_security_group.grafana_alb: Refreshing state... [id=sg-09dd2f977396b926a][0m
[0m[1mmodule.monitoring.aws_cloudwatch_metric_alarm.alb_target_response_time: Refreshing state... [id=prod-alb-response-time-high][0m
[0m[1mmodule.observability[0].aws_efs_file_system.grafana: Refreshing state... [id=fs-05b8eb193c75d83b5][0m
[0m[1mmodule.monitoring.aws_cloudwatch_log_group.nginx_error: Refreshing state... [id=/aws/ec2/prod/nginx/error][0m
[0m[1mmodule.monitoring.aws_cloudwatch_log_group.nginx_access: Refreshing state... [id=/aws/ec2/prod/nginx/access][0m
[0m[1mmodule.monitoring.aws_cloudwatch_metric_alarm.ghost_cpu_high: Refreshing state... [id=prod-ghost-cpu-high][0m
[0m[1mmodule.observability[0].aws_cloudwatch_log_group.grafana: Refreshing state... [id=/ecs/prod/grafana][0m
[0m[1mmodule.observability[0].aws_iam_policy.prometheus_ecs_discovery: Refreshing state... [id=arn:aws:iam::615299732970:policy/prod-prometheus-ecs-discovery][0m
[0m[1mmodule.observability[0].aws_efs_file_system.prometheus: Refreshing state... [id=fs-041cbf1c6bc074820][0m
[0m[1mmodule.observability[0].data.aws_region.current: Reading...[0m[0m
[0m[1mmodule.observability[0].data.aws_region.current: Read complete after 0s [id=us-east-1][0m
[0m[1mmodule.monitoring.aws_cloudwatch_dashboard.main[0]: Refreshing state... [id=prod-infrastructure-dashboard][0m
[0m[1mmodule.observability[0].aws_iam_role.ecs_task_execution: Refreshing state... [id=prod-monitoring-task-execution-role][0m
[0m[1mmodule.observability[0].aws_security_group.monitoring_tasks: Refreshing state... [id=sg-0ba45c9e2ac1444f8][0m
[0m[1mmodule.observability[0].aws_lb.grafana: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:615299732970:loadbalancer/app/prod-grafana-alb/900de8af48202642][0m
[0m[1mmodule.observability[0].aws_ssm_parameter.prometheus_config: Refreshing state... [id=/prod/prometheus/config][0m
[0m[1mmodule.observability[0].aws_efs_access_point.grafana: Refreshing state... [id=fsap-0860389da259e7bb3][0m
[0m[1mmodule.observability[0].aws_iam_role_policy_attachment.prometheus_ecs_discovery: Refreshing state... [id=prod-prometheus-task-role/arn:aws:iam::615299732970:policy/prod-prometheus-ecs-discovery][0m
[0m[1mmodule.observability[0].aws_service_discovery_service.prometheus: Refreshing state... [id=srv-ja4j4yaazvn7rhup][0m
[0m[1mmodule.observability[0].aws_efs_access_point.prometheus: Refreshing state... [id=fsap-096d0a48afec7b3ed][0m
[0m[1mmodule.observability[0].aws_security_group.monitoring_efs: Refreshing state... [id=sg-0c8e254e6db7c80ab][0m
[0m[1mmodule.observability[0].aws_iam_role_policy_attachment.ecs_task_execution: Refreshing state... [id=prod-monitoring-task-execution-role/arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy][0m
[0m[1mmodule.observability[0].aws_ecs_task_definition.grafana: Refreshing state... [id=prod-grafana][0m
[0m[1mmodule.observability[0].aws_ecs_task_definition.prometheus: Refreshing state... [id=prod-prometheus][0m
[0m[1mmodule.observability[0].aws_efs_mount_target.grafana[0]: Refreshing state... [id=fsmt-06d1d0ec80e1c289e][0m
[0m[1mmodule.observability[0].aws_efs_mount_target.prometheus[1]: Refreshing state... [id=fsmt-06823d72b419f7bd9][0m
[0m[1mmodule.observability[0].aws_efs_mount_target.prometheus[0]: Refreshing state... [id=fsmt-079cc6230227c6421][0m
[0m[1mmodule.observability[0].aws_efs_mount_target.grafana[1]: Refreshing state... [id=fsmt-01141731c73da903b][0m
[0m[1mmodule.observability[0].aws_lb_listener.grafana_https: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:615299732970:listener/app/prod-grafana-alb/900de8af48202642/661405fcfd202e86][0m
[0m[1mmodule.observability[0].aws_lb_listener.grafana_http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:615299732970:listener/app/prod-grafana-alb/900de8af48202642/72a0c758992d9ec7][0m
[0m[1mmodule.observability[0].aws_ecs_service.grafana: Refreshing state... [id=arn:aws:ecs:us-east-1:615299732970:service/prod-ghost-cluster/prod-grafana-service][0m
[0m[1mmodule.observability[0].aws_ecs_service.prometheus: Refreshing state... [id=arn:aws:ecs:us-east-1:615299732970:service/prod-ghost-cluster/prod-prometheus-service][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [33m~[0m update in-place[0m
[31m-[0m/[32m+[0m destroy and then create replacement[0m

Terraform will perform the following actions:

[1m  # module.observability[0].aws_ecs_service.prometheus[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_ecs_service" "prometheus" {
        id                                 = "arn:aws:ecs:us-east-1:615299732970:service/prod-ghost-cluster/prod-prometheus-service"
        name                               = "prod-prometheus-service"
        tags                               = {
            "Environment" = "prod"
            "ManagedBy"   = "Terraform"
            "Name"        = "prod-prometheus-service"
        }
        [90m# (19 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m service_registries {
          [33m~[0m[0m registry_arn   = "arn:aws:servicediscovery:us-east-1:615299732970:service/srv-ja4j4yaazvn7rhup" -> (known after apply)
            [90m# (2 unchanged attributes hidden)[0m[0m
        }

        [90m# (4 unchanged blocks hidden)[0m[0m
    }

[1m  # module.observability[0].aws_service_discovery_service.prometheus[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_service_discovery_service" "prometheus" {
      [33m~[0m[0m arn           = "arn:aws:servicediscovery:us-east-1:615299732970:service/srv-ja4j4yaazvn7rhup" -> (known after apply)
      [33m~[0m[0m id            = "srv-ja4j4yaazvn7rhup" -> (known after apply)
        name          = "prometheus"
      [33m~[0m[0m namespace_id  = "ns-36zgsqjndk6e5zki" -> (known after apply)
        tags          = {
            "Environment" = "prod"
            "ManagedBy"   = "Terraform"
            "Name"        = "prod-prometheus-discovery"
        }
      [33m~[0m[0m type          = "DNS_HTTP" -> (known after apply)
        [90m# (3 unchanged attributes hidden)[0m[0m

      [32m+[0m[0m health_check_custom_config {} [31m# forces replacement[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1mPlan:[0m 1 to add, 1 to change, 1 to destroy.
[0m
```
</details>